{
    "cartMenu": [
        {
            "itemID" : 0,
            "itemCategory": 1,
            "itemName": "Carne Asada",
            "itemDescription": "Grilled beef, soft corn tortillas, and fresh toppings – our Carne Asada Street Tacos are a taste of Mexico in every bite. Order now for a quick, flavorful feast!",
            "itemPrice": 4.99
        },
        {
            "itemID": 1,
            "itemCategory": 1,
            "itemName": "Pollo Asado",
            "itemDescription": "Juicy grilled chicken, nestled in warm corn tortillas, topped with onions, cilantro, and a squeeze of lime. A delicious twist on traditional street tacos.",
            "itemPrice": 5.49
        },
        {
            "itemID": 2,
            "itemCategory": 1,
            "itemName": "Al Pastor",
            "itemDescription": "Sliced pork marinated in adobo, char-grilled to perfection. Served on soft corn tortillas with pineapple, onions, and cilantro. A tantalizing fusion of flavors.",
            "itemPrice": 5.99
        },
        {
            "itemID": 3,
            "itemCategory": 1,
            "itemName": "Carnitas",
            "itemDescription": "Slow-cooked, tender pork, piled high on corn tortillas. Topped with diced onions, fresh cilantro, and a hint of lime. A classic favorite!",
            "itemPrice": 5.79
        },
        {
            "itemID": 4,
            "itemCategory": 1,
            "itemName": "Chorizo",
            "itemDescription": "Spicy Mexican sausage, cradled in warm corn tortillas. Garnished with onions, cilantro, and a zesty kick. A bold and flavorful choice.",
            "itemPrice": 6.29
        },
        {
            "itemID": 5,
            "itemCategory": 2,
            "itemName": "Quesadilla",
            "itemDescription": "Melted cheese sandwiched between two flour tortillas, with your choice of meat. Served with salsa and guacamole on the side.",
            "itemPrice": 7.99
        },
        {
            "itemID": 6,
            "itemCategory": 2,
            "itemName": "Nachos Supreme",
            "itemDescription": "Crunchy tortilla chips loaded with melted cheese, beans, your choice of meat, guacamole, sour cream, and pico de gallo. The ultimate nacho experience.",
            "itemPrice": 8.49
        },
        {
            "itemID": 7,
            "itemCategory": 2,
            "itemName": "Elote (Street Corn)",
            "itemDescription": "Grilled corn on the cob smothered in a savory blend of mayonnaise, cotija cheese, chili powder, and lime. A street food favorite.",
            "itemPrice": 3.99
        },
        {
            "itemID": 8,
            "itemCategory": 3,
            "itemName": "Horchata",
            "itemDescription": "Sweet and creamy rice milk infused with cinnamon. The perfect refreshing drink to complement your taco feast.",
            "itemPrice": 2.49
        },
        {
            "itemID": 9,
            "itemCategory": 3,
            "itemName": "Agua Fresca",
            "itemDescription": "Fruit-infused water with a touch of sweetness. Choose from flavors like watermelon, pineapple, or cucumber for a refreshing sip.",
            "itemPrice": 2.99
        },
        {
            "itemID": 10,
            "itemCategory": 3,
            "itemName": "Jarritos",
            "itemDescription": "Mexican soda in assorted fruity flavors – a perfect fizzy companion to your taco experience.",
            "itemPrice": 1.99
        },
        {
            "itemID": 11,
            "itemCategory": 3,
            "itemName": "Mexican Hot Chocolate",
            "itemDescription": "Rich and indulgent hot chocolate with a hint of cinnamon. A comforting beverage choice.",
            "itemPrice": 3.29
        },
        {
            "itemID": 12,
            "itemCategory": 1,
            "itemName": "Birria",
            "itemDescription": "Tender, slow-cooked shredded beef, wrapped in corn tortillas. Served with a side of consommé for dipping. A flavorful and comforting choice.",
            "itemPrice": 6.99
        },
        {
            "itemID": 13,
            "itemCategory": 1,
            "itemName": "Lengua",
            "itemDescription": "Beef tongue, cooked to perfection and nestled in warm corn tortillas. Topped with onions, cilantro, and a squeeze of lime. A savory delicacy.",
            "itemPrice": 7.49
        },
        {
            "itemID": 14,
            "itemCategory": 1,
            "itemName": "Vegetarian Tacos",
            "itemDescription": "Grilled veggies, black beans, and cheese tucked into soft corn tortillas. A delicious meat-free option bursting with flavor.",
            "itemPrice": 5.99
        },
        {
            "itemID": 15,
            "itemCategory": 1,
            "itemName": "Fish Tacos",
            "itemDescription": "Crispy, beer-battered fish fillets in warm corn tortillas. Topped with cabbage slaw, chipotle mayo, and a squeeze of lime. A seafood delight.",
            "itemPrice": 7.99
        },
        {
            "itemID": 16,
            "itemCategory": 2,
            "itemName": "Guacamole and Chips",
            "itemDescription": "Creamy, homemade guacamole served with a side of crispy tortilla chips. The perfect starter or snack.",
            "itemPrice": 4.49
        },
        {
            "itemID": 17,
            "itemCategory": 2,
            "itemName": "Sopes",
            "itemDescription": "Thick corn tortillas topped with beans, your choice of meat, lettuce, cheese, and salsa. A satisfying and savory dish.",
            "itemPrice": 6.79
        },
        {
            "itemID": 18,
            "itemCategory": 2,
            "itemName": "Tostadas",
            "itemDescription": "Crispy corn tortillas layered with beans, your choice of meat, lettuce, cheese, and salsa. A crunchy and flavorful delight.",
            "itemPrice": 6.29
        },
        {
            "itemID": 19,
            "itemCategory": 3,
            "itemName": "Mexican Coffee",
            "itemDescription": "Robust coffee brewed with a touch of cinnamon. A warm and aromatic way to complete your meal.",
            "itemPrice": 2.79
        }
    ]
}